[
    {
        "id": 9,
        "title": "HRNet",
        "category": "Formation",
        "content": "Passer une librairie jQuery vers React..",
        "fullContent": "Convertir l'ensemble du projet HRNet utilisant du Jquery, a une single page application React. Création de composants from scratch et upload sous npm pour en faire des librairies. Optimisation des performances, gestion d'état.",
        "techno": "HTML, CSS, Tailwind, React, React Router, Redux, Redux Toolkit",
        "github": "https://github.com/QuentDa/QuentinDeAndrade_14_2023",
        "live": "disabled",
        "img": "/img/hrnet.jpg",
        "secondImg": "/img/hrnet2.jpg"
    },
    {
        "id": 8,
        "title": "argentbank",
        "category": "Formation",
        "content": "Utiliser une API pour un compte utilisateur bancaire avec React..",
        "fullContent": "Développement d'une application web. Récupération de la data située dans une base de donnée MongoDB avec Axios. Authentification des utilisateurs permettant aux clients de se connecter, gérer leurs comptes et leur profil. Utilisation d'endpoints pour la récupération des transactions, tout ça suivi grâce à un Swagger.",
        "techno": "HTML, CSS, React, React Router, Redux Toolkit, Redux Axios, MongoDB, Swagger",
        "github": "https://github.com/QuentDa/QuentinDeAndrade_13_2022",
        "live": "disabled",
        "img": "/img/argentbank.jpg",
        "secondImg": "/img/sportsee.jpg"
    },
    {
        "id": 7,
        "title": "sportsee",
        "category": "Formation",
        "content": "Développer un tableau de bord d'analytics avec React, fetch d'API..",
        "fullContent": "Plateforme dédiée au coaching sportif en pleine croissance. Lancement d'une nouvelle version pour permettre aux utilisateurs de suivre le nombre de sessions réalisées ainsi que le nombre de calories brûlées. Intégration maquette 1:1 avec une double navigation horizontale et verticale. Utilisation de librairie pour implémenter des graphiques, et utilisation de la data avec un fetch d'API.",
        "techno": "HTML, CSS, React, React Router",
        "github": "https://github.com/QuentDa/QuentinDeAndrade_12_2022",
        "live": "disabled",
        "img": "/img/sportsee.jpg",
        "secondImg": "/img/sportsee.jpg"
    },
    {
        "id": 6,
        "title": "Kasa",
        "category": "Formation",
        "content": "Développer une application Web avec React et React Router..",
        "fullContent": "Plateforme de location d'appartements entre particuliers. Création d'une single page application avec React et React Router. Création de composants tels qu'un carousel et un système de notation. Intégration de data au format JSON.",
        "techno": "HTML, CSS, React, React Router",
        "github": "https://github.com/QuentDa/QuentinDeAndrade_11_2022-",
        "live": "disabled",
        "img": "/img/kasa.png",
        "secondImg": "/img/kasa2.jpg"
    },
    {
        "id": 5,
        "title": "Les petits plats",
        "category": "Formation",
        "content": "Créer un algorithme de recherche en Javascript..",
        "fullContent": "Plateforme de recette de cuisine avec un algorithme de recherche sur les ingrédients, le nom de la recette ou des quantités. Ajout d'un système de filtrage par tag. La data est prise en charge par un fichier JSON.",
        "techno": "HTML, CSS, Javascript",
        "github": "https://github.com/QuentDa/QuentinDeAndrade_7_21042022-",
        "live": "disabled",
        "img": "/img/lespetitsplats.jpg",
        "secondImg": "/img/lespetitsplats.jpg"
    },
    {
        "id": 4,
        "title": "FishEye",
        "category": "Formation",
        "content": "Créer une plateforme pour photographes..",
        "fullContent": "Plateforme de photographes, qui propose des services de prise de vue, de reportage et de vente de photos. Création d'un site web accessible et optimisé pour les moteurs de recherche. W3C friendly. Intégration maquettes, exploitation de data au format JSON.",
        "techno": "HTML, CSS, Javascript",
        "github": "https://github.com/QuentDa/QuentinDeAndrade_6_07012022",
        "live": "disabled",
        "img": "/img/fisheye.png",
        "secondImg": "/img/fisheye.png"
    },
    {
        "id": 3,
        "title": "GameOn",
        "category": "Formation",
        "content": "Créer une landing page avec Javascript..",
        "fullContent": "Mission de développeur Front-End Junior chez GameOn, spécialisé dans les conférences et les concours de jeux. Création de modal, implémentation d'un formulaire, ajout de tests personnalisés et gestion des erreurs, confirmation d'envoi.",
        "techno": "HTML, CSS, Javascript",
        "github": "https://github.com/QuentDa/GameOn-website-FR",
        "live": "https://quentda.github.io/GameOn-website-FR/",
        "img": "/img/gameon.png",
        "secondImg": "/img/gameon2.jpg"
    },
    {
        "id": 2,
        "title": "ohmyfood",
        "category": "Formation",
        "content": "Dynamiser une page web avec des animations CSS..",
        "fullContent": "Développer un site “mobile first” qui répertorie les menus de restaurants gastronomiques. En plus des systèmes classiques de réservation, les clients pourront composer le menu de leur repas pour que les plats soient prêts à leur arrivée. Création d'animations from scratch pour dynamiser l'interface de l'application.",
        "techno": "HTML, sCSS",
        "github": "https://github.com/QuentDa/QuentinDeAndrade_3_17112021",
        "live": "https://quentda.github.io/QuentinDeAndrade_3_17112021/",
        "img": "/img/ohmyfood.png",
        "secondImg": "/img/ohmyfood2.jpg"
    },
    {
        "id": 1,
        "title": "Booki",
        "category": "Formation",
        "content": "Transformer une maquette en site web..",
        "fullContent": "Intégration d'une maquette Figma 1:1 en HTML et sCSS pour Booki, une entreprise de location immobilière.",
        "techno": "HTML, sCSS",
        "github": "https://github.com/QuentDa/QuentinDeAndrade_2_06112021",
        "live": "https://quentda.github.io/QuentinDeAndrade_2_06112021/",
        "img": "/img/booki.png",
        "secondImg": "/img/booki2.jpg"
    },
    {
        "id": 100,
        "title": "MrDomot",
        "category": "Autodidacte",
        "content": "Création d'un e-commerce from scratch en PHP",
        "fullContent": "Un de mes premiers projet pour me former en 2018. Le but a été de me former à la programmation PHP et l'utilisation d'une base de donnée avec mySQL. Création d'un site e-commerce from scratch, avec un parcours utilisateur fonctionnel, des fonctionnalités telles qu'un système de recherche, d'ajout au panier avec possibilité de modifier la quantité et de le vider grâce au stockage en session. Les utilisateurs ainsi que les produits ont été stocké en base de donnée. Mise en place d'un back office administrateur permettant de pouvoir ajouter des produits grâce à un envoi de formulaire. Plus tard le projet a été converti en MVC.",
        "techno": "HTML, CSS, Bootstrap, Javascript, PHP, MySQL",
        "github": "https://github.com/QuentDa/mrdomot",
        "live": "disabled",
        "img": "/img/mrdomotplaceholder.jpg",
        "secondImg": "/img/mrdomotplaceholder.jpg"
    },
    {
        "id": "1000",
        "title": "Mes autres projets",
        "category": "Autodidacte",
        "content": "Autres projets",
        "fullContent": "Mon parcours a débuté en 2017, et j'ai pu me former petit à petit en explorant différents langages de programmation. Tout mes projets ne sont pas cités ici, mais vous pouvez les retrouver sur mon github. Plus vous descendez, plus vous avez la possibilité de voir mon évolution.",
        "techno": "HTML, CSS, Bootstrap, Tailwind, PHP, MySQL, MongoDB, NodeJS, Axios, React, React Router, Redux, Redux Toolkit, Liquid, fetch d'API..",
        "github": "https://github.com/QuentDa",
        "live": "disabled",
        "img": "/img/mrdomotplaceholder.jpg",
        "secondImg": "/img/mrdomotplaceholder.jpg"        
    }
]